{"_id":"f80c64da637c91e000d3872905c3e111","skill":"▶For centuries, in the countries of south and Southeast Asia the elephant has been an intimate part of the culture, economy and religion, and nowhere more so than in Thailand. Unlike its African cousin, the Asian elephant is easily domesticated (驯化). The rare so-called white elephants have actually lent the authority of kingship to its rulers and until the 1920s the national flag was a white elephant on a red background.To the early Western visitors the country's romantic name was “Land of the White Elephant”.\n  ▶Today, however, the story is very different. Out of work and out of land, the Thai elephant struggles for survival in a nation that no longer needs it. The elephant has found itself more or less abandoned by previous owners who have moved on to a different economic world and a westernized society. And while the elephant's problems began many years ago, now it rates a very low national priority.\n  ▶How this reversal from national icon (圣像) to neglected animal came about is a tale of worsening environmental and the changing lives of the Thais themselves. According to Richard Lair, Thailand’s experts on the Asian elephant and author of the report Gone Astray, at the turn of the century there may well have beenas many as 100,000 domestic elephants in the country. In the north of Thailand alone it was estimated that more than 20,000 elephants were employed in transport, 1,000 of them alone on the road between the cities of Chiang Mai and Chiang Saen. This was at a time when 90 per cent of Thailand was still forest—a habitat (栖息地) that not only supported the animals but also made them necessary to carry goods and people. Nothing ploughs through dense forest better than a massive but sure-footed elephant.\n  ▶By 1950 the elephant population had dropped to a still substantial 13,397, but today there are probably nomore than 3,800, with another 1,350 roaming free in the national parks. But now, Thailand’s forest coversonly 20 per cent of the land. This deforestation (采伐森林) is the central point of the elephant's difficult situation, for it has effectively put the animals out of work. This century, as the road network grew, so the elephant's role as a beast of burden declined.","word1":"Barren: α.贫瘠的，不毛的","word4":"Simultaneously: ad. 同时发生地","option2_4":"this name was so romantic that it was popular among visitors","option3_1":"Because the elephants are no longer useful to their owners.","option3_4":"Because there are too many elephants and too few jobs.","option4_1":"There were 100,000 tamed elephants at the turn of the century.","option4_2":"20,000 elephants were employed in transport in Thailand at the turn of the century.","answer4":"4","option1_1":"It is easy to tame them.","word2":"Subordinate: a. 次要的，从属的","question2":"Thailand was once called “Land of the White Elephant” because_______.","_openid":"owWMN5ff1BFo-s4Cf9TmlgGs5h6s","answer3":"1","ming":"Ecological Crisis of Elephants in Thailand","option1_3":"They are living a better life than Asian elephants.","option3_2":"Because their owners are westernized and neglect them.","name":"Animal topics","option1_2":"It is hard to tame them.","option2_1":"white elephant is rarely seen and thus very special","option2_2":"white elephant was a national symbol until the 1920s","word3":"Notorious: a. 臭名昭著的，声名狼藉的","answer2":"2","imagepath":"https://i.imgtg.com/2022/11/14/tAqSj.jpg","option1_4":"Their fate is quite similar to that of Asian elephants.","option2_3":"white elephant has helped kings to gain the ruling authority","option3_3":"Because the government pays little attention to the problem.","answer1":"2","flag":1.0,"question1":"What can we know about African elephants from the passage?","level":"https://i.imgtg.com/2022/11/13/tN5wF.png","location":"泰国大象的生存危机","option4_3":"By 1950 the elephant population in Thailand has been quite small.","question4":"Which of the following statements is true about the elephant population at various times?","word5":"Mechanism: n. 机械装置","option4_4":"Today the elephant population is estimated at 5,150.","question3":"Why is the Thai elephant “out of work”, according to the author?","word6":"Denial: n. 否认，否定，拒绝给与(正义，权利)","word7":"Smash: n. 打碎，粉碎"}
{"_id":"30ed8da3637ccbb600b7a82a3e246e15","_openid":"owWMN5ff1BFo-s4Cf9TmlgGs5h6s","level":"https://i.imgtg.com/2022/11/13/tN5wF.png","word3":"obstacle: n.障碍，阻碍","option2_1":"Most electronic products contain plastics.","option2_3":"Recycled plastics can be integrated into new products.","answer2":"2","option1_1":"the government","option1_4":"the sellers","option4_4":"magnesium must be better than the plastics","question2":"Which of the following is NOT the character of plastics?","word2":"disassemble: v.拆卸，拆开","option1_3":"the consumers","option3_2":"a kind of plastics with different integration in each layer","option4_1":"disposing the plastics is one of NEC Corp’s businesses","option4_3":"21-inch TV with magnesium case isn’t very popular so far","answer1":"3","imagepath":"https://i.imgtg.com/2022/11/17/tG20I.jpg","option1_2":"the manufacturers","word4":"flexibility: n.灵活性，柔韧性","word1":"disposal: n.处置，处理","answer4":"3","ming":"Recyclability of electronic products","name":"Science and technology topics","option3_1":"a kind of sandwich-shaped toy made of plastics","question3":"According to the passage, the term “plastic sandwich” refers to_____.","question4":"In the passage, it is implied but NOT stated that_____.","skill":"▶Japan is getting tough about recycling—and not in the paper and plastic kind of way. Recently, the country requires that all electronic goods—TVs, VCRs, stereos, and more—be recycled. But recycling will not beleft to consumers, instead, the devices will be sent to the original manufacturer for proper disposal.\n  ▶The new law poses a few challenges to manufacturers who are now rushing to set up collection networks and perfecting techniques to disassemble and recycle older products.With an eye toward the future, they are also integrating easily recycled materials into new products. Plastics, a major component of most electronicproducts,pose a particular obstacle because their quality becomes worse and worse with age,losing strengthand flexibility even if reprocessed.NEC Corp. overcomes this problem by creating a plastics sandwich, in which the filling is 100 percent recycled plastic and the outer layers a mixture of 14 percent recycled material.The resulting plastic has sufficient strength and toughness for use as a case for desktop PCs. The company, in cooperation with plastic maker Sumitomo Dow, has also developed a new plastic, which engineers claim retains its mechanical properties through repeated recycling. NEC uses the plastic, which is also flame-retardant (阻燃的) in battery cases for notebook PCs.\n  ▶Meanwhile, Matsushita Electric, maker of the Panasonic brand, is avoiding plastic in favor of magnesium (镁). Magnesium, says the company, is ideal for re cycling because it retains its original strength throughrepeated reprocessing. Matsushita has developed molding techniques to form magnesium into the case for a 21-inch TV. Unfortunately, the magnesium case and energy-saving features make the TV about twice as expensive as an ordinary model.The company hopes, however, that increased use of magnesium will eventually bring prices down.","word5":"sufficient: a.足够的，充足的","word7":"retains: n.保持，保留","answer3":"2","option2_2":"It retains its original strength through reprocessing.","option3_3":"a kind of plastics with maximum strength and flexibility","option3_4":"a kind of plastics made of 100% recycled materials","option4_2":"magnesium is an ideal material for the case of TV","flag":1.0,"location":"电子产品的可循环","option2_4":"Plastics will lose flexibility after a certain period of time.","question1":"According to the present regulations of Japan, the recycling of paper and plastic will be the responsibility of______.","word6":"battery: n.电池，一组"}
{"_id":"b8bddf3b637cdc1700f2ed2f6c9acd97","level":"https://i.imgtg.com/2022/11/13/tN5wF.png","ming":"Geography and People","option1_2":"call for more research on the influence of geographical environment","option2_3":"help provide breeding places for pests.","question2":"It can be inferred that proper amounts of iodine, fluoride and calcium can_____.","answer2":"1","imagepath":"https://i.imgtg.com/2022/11/17/tG9BG.jpg","option2_4":"strengthen a person's character","option4_4":"People who like drinking cow blood tend to be strong and tall.","answer4":"3","option1_1":"alert readers to the scarcity of natural resources","word5":"contributory: a.促成的，促进的","question1":"The author's purpose of writing this passage is to______.","word2":"landscape: n.景观，景色","question3":"How does the author evaluate the generalizations of people's types in Para. 3?","answer3":"2","option3_3":"Such generalizations prove that nature plays an important role in determining social","option2_2":"influence the quality of water supply","option3_2":"Such generalizations are not inclusive enough to draw a convincing conclusion.","option4_2":"People who live in mountain areas tend to have a long life.","option4_3":"People who live in areas with stable climate tend to be talkative and lively.","question4":"What do we know about the generalizations of people’s type?","skill":"▶A subject which seems to have been insufficiently studied by doctors and psychologists is the influence of geography and climate on the psychological and physical health of mankind.There seems no doubt that the general character of the landscape, the relative length of day and night, and the climate must all play a big part in determining what kind of people we are.\n  ▶It is true that a few studies have been made. Where all the inhabitants of a particular area enjoy exceptionally good or bad health, scientists have identified .contributory factors such as the presence or absence of substances like iodine, fluoride, calcium, or iron in the water supply, or perhaps types of land thatprovide breeding places for pests like mosquitoes or rats.\n  ▶Moreover, we can all generalize about types of people we have met. Those living in countries .with long dark winters are apt to be less talkative and less vivacious than inhabitants of countries where the climateis more equable(稳定的). And where the olive and the orange grow, there the inhabitants are cheerful, talkative, and spontaneous.\n  ▶But these commonplace generalizations are inadequate: the influence: of climate and geography should be studied in depth. Do all mountain dwellers live to a ripe old age? Does the drinking of wine, rather than beer, result in a sunny and open temperament? Is the strength and height of one of the Kenyan tribes due to their habitual drinking of the blood of cows?\n▶We are not yet sure of the answers to such .questions, but let us hope that something of benefit to mankind may eventually result from such studies.","option1_4":"draw more attention to the health condition of mankind","option2_1":"benefit people’s physical health","word1":"insufficiently: av.不充分地，不能胜任地","word4":"exceptionally: av.破例，罕见","word3":"inhabitants: n.居民，栖息动物","word6":"vivacious: a.可爱的，活泼的","answer1":"2","option3_4":"Such generalizations show that there are mainly two different types of people on the planet.","location":"地理和人","name":"Geographic topics","option1_3":"introduce different elements in character cultivation","option3_1":"Such generalizations help us judge the different characters of people we meet","option4_1":"People who like drinking wine tend to be optimistic.","word7":"dwellers: n.居民，居住者","_openid":"owWMN5ff1BFo-s4Cf9TmlgGs5h6s","flag":1.0}
